{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "SimpleRNN", "config": {"activation": "tanh", "return_state": false, "go_backwards": false, "name": "simple_rnn_1", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "bias_constraint": null, "units": 400, "use_bias": true, "unroll": false, "activity_regularizer": null, "return_sequences": true, "batch_input_shape": [null, 20, 26], "recurrent_dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0}}, {"class_name": "SimpleRNN", "config": {"activation": "tanh", "return_state": false, "go_backwards": false, "name": "simple_rnn_2", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "bias_constraint": null, "units": 400, "use_bias": true, "unroll": false, "activity_regularizer": null, "return_sequences": false, "recurrent_dropout": 0.0, "implementation": 0, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "dropout": 0.0}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "units": 400, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "units": 20, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}], "keras_version": "2.0.6"}